__mod_name__ = "Tools"

__help__ = """
*معلومات Sangmata بوت*
❂ /sg <الرد>*:* للتحقق من اسم التاريخ

*التاريخ والوقت والطقس*
❂ /time <الرقم الدولي>*:* يعطي معلومات حول منطقة زمنية.
❂ /weather <مدينة>*:* الحصول على معلومات الطقس في مكان معين.
❂ /wttr <مدينة>*:* وحدة الطقس المتقدمة ، نفس الاستخدام مثل /weather
❂ /wttr moon*:* احصل على الوضع الحالي للقمر

*المتحولون*
❂ /encrypt*:* يشفر النص المعطى
❂ /decrypt*:* يفك تشفير النص المشفر مسبقًا
❂ /zip*:* الرد على ملف في التليجرام لضغطه بتنسيق zip
❂ /unzip*:* الرد على ملف في التليجرام لفك ضغطه من تنسيق .zip

*عشوائية API*
❂ /ptl or !asupan: احصل على فيديو عشوائي من الجدول الزمني في Instagram
❂ /chika: الحصول على فيديو عشوائي من chikakiku
❂ /wibu:احصل على فيديو أو صور أنيمي قصيرة عشوائية
❂ /truth: challenge 
❂ /dare: challenge
Link To File:
❂ /up: الرد على رابط التنزيل المباشر لتحميله على Telegram كملفات
 
 ملف للارتباط:
❂ /transfersh: الرد على ملف في التليجرام لتحميله على عمليات النقل والحصول على رابط تنزيل مباشر
❂ /tmpninja: الرد على ملف في التليجرام لتحميله على tmpninja والحصول على رابط التحميل المباشر
 ملف أو نص إلى تلغراف:
❂ /tgm : احصل على رابط Telegraph للوسائط التي تم الرد عليها
❂ /tgt: احصل على رابط Telegraph للنص الذي تم الرد عليه

 تاك
❂ /tagall : لوضع علامة على الجميع 100 عضو على الأقل أولاً.
"""
